Revit 2027 API
RebarConstraint.GetTargetRebarEdgeNumber Method
 Gets the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge'. Rebar must be Shape Driven Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetTargetRebarEdgeNumber()
Public Function GetTargetRebarEdgeNumber As Integer
public:
int GetTargetRebarEdgeNumber()
member GetTargetRebarEdgeNumber : unit -> int
Return Value
Int32
 Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element, or it's attached to multiple edges.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace